domschl/LugalOS/drivers/uart_esp32p4.c
/*
 * LugalOS driver: UART0 on the ESP32-P4 -- E2,
 * plan/phase27_esp32p4_bringup.md.
 *
 * The console, and in E2 the only wire this board has.
 *
 * ## Why this configures hardware the boot ROM already configured
 *
 * E1 established that the ROM hands over a fully working UART0: clocked,
 * muxed onto GPIO37/38, 115200 8N1. tools/minimal_esp32p4.c therefore wrote
 * bytes and nothing else, which was exactly right for a program whose job
 * was to prove the chip was alive.
 *
 * A kernel may not do that. "It works because of what the loader left
 * behind" is a property of one boot path, and this image is meant to acquire
 * more of them: E6 boots it from flash through a second-stage bootloader,
 * which arrives with different peripheral state, and anything that touches
 * the clock tree later can change the divisor under a console that never
 * asked for one. So this file states every value it depends on.
 *
 * ## Why the source clock is the crystal
 *
 * XTAL_CLK, not the 80 MHz PLL. The board's crystal is 40 MHz
 * (CONFIG_XTAL_HZ, and esptool reports it on every connect), and unlike the
 * PLL it does not move when the CPU clock does. Selecting it means the
 * console's baud rate does not depend on the clock tree at all -- so E2 gets
 * a shell without bringing the PLL up, and no later milestone can take the
 * console away by changing a CPU frequency. The cost is that 115200 comes
 * out of a 40 MHz divisor rather than an 80 MHz one, which changes the error
 * from 0.00% to 0.008%: about 1/10000th of a bit period across a 10-bit
 * frame, which is four orders of magnitude inside what a UART tolerates.
 *
 * ## Interrupt-driven since E3, with the polling still underneath
 *
 * E2 shipped this file entirely polled, because there was no route from a
 * peripheral to a handler until the CLIC came up. E3 built that route, and
 * this file is its first user: RX and TX both block on an interrupt now, and
 * the sched_yield() spins survive as the fallback for the cases that cannot
 * block -- before sched_init(), or when the single waiter slot in a
 * direction is already taken. Same two-path shape as
 * drivers/uart_16550.c, which is now literally true rather than aspirational.
 *
 * The consequence to know about: there is still no preemption timer (E4), so
 * a task that blocks on a keystroke really does sleep until the key arrives
 * -- but nothing periodically re-examines a task that got stuck some other
 * way. Interrupts fixed the console's idle behaviour, not the scheduler's.
 *
 * ## Register provenance
 *
 * Every offset and bit position below was read from the ESP32-P4 TRM
 * chapters 16 and 45 and cross-checked against ESP-IDF's generated
 * components/soc/esp32p4/register/hw_ver1/soc/uart_reg.h -- hw_ver1 because
 * this board is chip revision v1.3. Nothing here is carried over from
 * another Espressif part; section 3.2 of the phase plan says why, and phase
 * 24's 0x88888888 is what it cost the last time that rule was skipped.
 */

#include "drivers/uart.h"
#include "drivers/uart_net.h"
#include "kernel/devirq.h"
#include "kernel/irq.h"
#include "kernel/sched.h"
#include "kernel/hart.h"
#include "kernel/lock.h"
#include "kernel/chan.h"
#include "kernel/printk.h"
#include "arch/trap.h"
#include "arch/esp32p4_intr.h"
#include "lugalos_config.h"
#include <string.h>

#define REG(a) (*(volatile uint32_t *)(uintptr_t)(a))

/* --- UART0 registers (TRM chapter 45, Register Summary) ----------------- */

static uintptr_t g_uart_base = CONFIG_UART0_BASE;

#define UART_FIFO(base)         ((base) + 0x00)  /* RO/WO FIFO data port     */
#define UART_INT_RAW(base)      ((base) + 0x04)  /* raw interrupt status     */
#define UART_INT_ST(base)       ((base) + 0x08)  /* masked interrupt status  */
#define UART_INT_ENA(base)      ((base) + 0x0c)  /* interrupt enable         */
#define UART_INT_CLR(base)      ((base) + 0x10)  /* write 1 to clear         */
#define UART_CLKDIV_SYNC(base)  ((base) + 0x14)  /* baud divisor, int + frac */
#define UART_STATUS(base)       ((base) + 0x1c)  /* RXFIFO_CNT / TXFIFO_CNT  */
#define UART_CONF0_SYNC(base)   ((base) + 0x20)  /* frame format, FIFO reset */
#define UART_CONF1(base)        ((base) + 0x24)
#define UART_CLK_CONF(base)     ((base) + 0x88)  /* core clock enable/reset  */
#define UART_REG_UPDATE(base)   ((base) + 0x98)  /* commit the _SYNC regs    */

/* UART_STATUS_REG (TRM Register 45.21). Both counters are 8 bits, and the
 * FIFO is 128 bytes deep (SOC_UART_FIFO_LEN), so neither can wrap.
 *
 * Note the TRM's own text for TXFIFO_CNT reads "the number of valid data
 * bytes in RX FIFO" -- a copy-paste slip in the manual, not a second RX
 * counter; the field name, the bit range and IDF's header all agree it is
 * the TX side. Worth writing down because E1 left "a TXFIFO_CNT field this
 * tree has not yet verified against hardware" as an open suspect for a
 * garbled-output report, and this is that field, now verified. */
#define UART_RXFIFO_CNT_SHIFT   0
#define UART_RXFIFO_CNT_MASK    0xffu
#define UART_TXFIFO_CNT_SHIFT   16
#define UART_TXFIFO_CNT_MASK    0xffu
#define UART_FIFO_DEPTH         128u

/* UART_CONF0_SYNC_REG (TRM Register 45.9). */
#define UART_PARITY_EN          (1u << 1)
#define UART_BIT_NUM_SHIFT      2       /* 0=5b 1=6b 2=7b 3=8b */
#define UART_BIT_NUM_MASK       (3u << UART_BIT_NUM_SHIFT)
#define UART_BIT_NUM_8          (3u << UART_BIT_NUM_SHIFT)
#define UART_STOP_BIT_NUM_SHIFT 4       /* 1=1b 2=1.5b 3=2b; 0 is invalid */
#define UART_STOP_BIT_NUM_MASK  (3u << UART_STOP_BIT_NUM_SHIFT)
#define UART_STOP_BIT_NUM_1     (1u << UART_STOP_BIT_NUM_SHIFT)
#define UART_LOOPBACK           (1u << 12)
#define UART_TX_FLOW_EN         (1u << 13)
#define UART_RXFIFO_RST         (1u << 22)
#define UART_TXFIFO_RST         (1u << 23)

/* The interrupt bits, identical across INT_RAW / INT_ST / INT_ENA / INT_CLR
 * (TRM Registers 45.2-45.5). Only three of the twenty are used here.
 *
 * INT_ST is INT_RAW masked by INT_ENA, which is the property the ISR relies
 * on: clearing a bit in INT_ENA takes the line down at the source even while
 * the underlying condition persists. Since RXFIFO_FULL and TXFIFO_EMPTY are
 * both *conditions* rather than events -- they re-assert as soon as they are
 * cleared, for as long as the FIFO stays that way -- INT_ENA is the only
 * thing standing between an enabled console interrupt and an interrupt
 * storm. Every path below therefore disables before it clears, never the
 * other way round.
 *
 * RXFIFO_TOUT is enabled alongside RXFIFO_FULL and not instead of it. The
 * TRM says only "Configures the threshold for RX FIFO being full"; IDF's
 * generated header is the one that says "when receiver receives more data
 * than this register value", i.e. strictly greater, which would make a
 * threshold of 1 need two bytes to fire and lose the first keystroke of
 * every line. The timeout closes that: it fires when the receiver has been
 * idle for RX_TOUT_THRHD byte-times with anything at all in the FIFO. IDF's
 * own driver enables the pair together for the same reason
 * (esp_driver_uart/src/uart.c), which is the corroboration for reading the
 * threshold as exclusive rather than assuming the friendlier one. */
#define UART_RXFIFO_FULL_INT    (1u << 0)
#define UART_TXFIFO_EMPTY_INT   (1u << 1)
#define UART_RXFIFO_TOUT_INT    (1u << 8)
#define UART_RX_INTS            (UART_RXFIFO_FULL_INT | UART_RXFIFO_TOUT_INT)

/* UART_CONF1_REG (TRM Register 45.10). Not a _SYNC register -- it takes
 * effect without the UART_REG_UPDATE handshake, which IDF's uart_ll.h
 * confirms by writing it directly. */
#define UART_RXFIFO_FULL_THRHD_SHIFT   0
#define UART_RXFIFO_FULL_THRHD_MASK    (0xffu << UART_RXFIFO_FULL_THRHD_SHIFT)
#define UART_TXFIFO_EMPTY_THRHD_SHIFT  8
#define UART_TXFIFO_EMPTY_THRHD_MASK   (0xffu << UART_TXFIFO_EMPTY_THRHD_SHIFT)

/* UART_TOUT_CONF_SYNC_REG (TRM Register 45.17) -- this one *is* _SYNC and
 * needs the commit. RX_TOUT_THRHD is in byte-times, [11:2]. */
#define UART_TOUT_CONF_SYNC(base) ((base) + 0x64)
#define UART_RX_TOUT_EN         (1u << 0)
#define UART_RX_TOUT_THRHD_SHIFT 2
#define UART_RX_TOUT_THRHD_MASK  (0x3ffu << UART_RX_TOUT_THRHD_SHIFT)

/* UART_CLKDIV_SYNC_REG (TRM Register 45.7): a 12-bit integer part and a
 * 4-bit fraction in sixteenths, i.e. the divisor is CLKDIV + FRAG/16. */
#define UART_CLKDIV_MASK        0xfffu
#define UART_CLKDIV_FRAG_SHIFT  20
#define UART_CLKDIV_FRAG_MASK   (0xfu << UART_CLKDIV_FRAG_SHIFT)

