domschl/LugalOS/drivers/uart_esp32p4.c
/* UART_CLK_CONF_REG (TRM Register 45.20). */
#define UART_TX_SCLK_EN         (1u << 24)
#define UART_RX_SCLK_EN         (1u << 25)
#define UART_TX_RST_CORE        (1u << 26)
#define UART_RX_RST_CORE        (1u << 27)

/* --- Clock and reset control (TRM chapter 8, HP_SYS_CLKRST) -------------
 *
 * 0x500E6000 = DR_REG_HPPERIPH1_BASE (0x500C0000) + 0x26000, TRM Table
 * 9.3-2. UART0's three knobs are spread across three registers, and the
 * split is not intuitive enough to guess at: the source select and the gate
 * are in PERI_CLK_CTRL110, while the *divider for the same UART* is in
 * PERI_CLK_CTRL111 alongside UART1's source select. Transcribed field by
 * field rather than reasoned about. */
#define HP_SYS_CLKRST_BASE      0x500E6000UL
#define SOC_CLK_CTRL1           (HP_SYS_CLKRST_BASE + 0x18)
#define SOC_CLK_CTRL2           (HP_SYS_CLKRST_BASE + 0x1c)
#define PERI_CLK_CTRL110        (HP_SYS_CLKRST_BASE + 0x68)
#define PERI_CLK_CTRL111        (HP_SYS_CLKRST_BASE + 0x6c)

/* SOC_CLK_CTRL1 bit 18 and SOC_CLK_CTRL2 bit 7. Both were read off the TRM's
 * own bit diagrams (Registers 11.7 and 11.8, pages 1108 and 1113) by
 * counting the field labels down from bit 31, then checked against IDF's
 * generated hp_sys_clkrst_reg.h -- which is the only reason they are right.
 * The first draft of this file had them at 24 and 25, reasoned from where
 * UART0 sits in the peripheral list, and they are nowhere near: the two
 * registers order their fields differently from each other, so there is no
 * position to infer. Exactly the failure section 3.2 of the phase plan
 * forbids. */
#define UART0_SYS_CLK_EN        (1u << 18)      /* SOC_CLK_CTRL1  */
#define UART0_APB_CLK_EN        (1u << 7)       /* SOC_CLK_CTRL2  */
#define UART0_CLK_SRC_SEL_SHIFT 24              /* PERI_CLK_CTRL110: 0=XTAL */
#define UART0_CLK_SRC_SEL_MASK  (3u << UART0_CLK_SRC_SEL_SHIFT)
#define UART0_CLK_SRC_XTAL      (0u << UART0_CLK_SRC_SEL_SHIFT)
#define UART0_CLK_EN            (1u << 26)      /* PERI_CLK_CTRL110 */
#define UART0_SCLK_DIV_NUM_MASK 0xffu           /* PERI_CLK_CTRL111, [7:0] */

/* --- IO_MUX (TRM chapter 10) --------------------------------------------
 *
 * 0x500E1000 = DR_REG_HPPERIPH1_BASE + 0x21000, and the per-pad register is
 * base + 0x4 + 4*n -- the same two facts tools/minimal_esp32p4.c already
 * used to toggle GPIO20 in E1, so they are confirmed on this silicon and not
 * only on paper.
 *
 * MCU_SEL selects which peripheral owns the pad. Function 0 on GPIO37 is
 * UART0_TXD and function 0 on GPIO38 is UART0_RXD (IDF's io_mux_reg.h:
 * FUNC_GPIO37_UART0_TXD_PAD 0, FUNC_GPIO38_UART0_RXD_PAD 0) -- a direct
 * IO_MUX route, not a GPIO-matrix one, so there is no signal index to
 * program and no GPIO_FUNCn_OUT_SEL_CFG write. Function 1 on both is plain
 * GPIO, which is what E1's toggle needed and this does not.
 *
 * MCU_SEL resets to 0, which is why the ROM console works before anyone has
 * configured anything; writing it anyway is the point of this file. */
#define IOMUX_BASE              0x500E1000UL
#define IOMUX_PAD(n)            (IOMUX_BASE + 0x4 + 4u * (n))
#define IOMUX_MCU_SEL_SHIFT     12
#define IOMUX_MCU_SEL_MASK      (7u << IOMUX_MCU_SEL_SHIFT)
#define IOMUX_FUN_UART0         (0u << IOMUX_MCU_SEL_SHIFT)
#define IOMUX_FUN_IE            (1u << 9)
#define IOMUX_FUN_PU            (1u << 8)

/* --- the register-update handshake --------------------------------------
 *
 * The registers named *_SYNC live in the UART core's clock domain rather
 * than the APB one, and a write to them does nothing until
 * UART_REG_UPDATE_REG bit 0 is written and self-clears. Forgetting it does
 * not fail loudly: the readback shows the value you wrote, and the hardware
 * keeps using the old one. That is a whole afternoon if it is not written
 * down, so it is a named function and every caller goes through it.
 *
 * Bounded, because this runs before the console exists and a hang here has
 * nothing to print with. The bound is arbitrary-but-generous rather than
 * calibrated -- the synchroniser takes a handful of core-clock cycles, and
 * at the worst plausible clock ratio that is far under 100000 spins. */
static void uart_commit(uintptr_t base) {
    REG(UART_REG_UPDATE(base)) = 1u;
    for (unsigned i = 0; i < 100000u && (REG(UART_REG_UPDATE(base)) & 1u); i++) {
        /* spin */
    }
}

/* --- raw hardware access ------------------------------------------------ */

static bool hw_uart_has_char(void) {
    if (!g_uart_base) return false;
    uint32_t st = REG(UART_STATUS(g_uart_base));
    return ((st >> UART_RXFIFO_CNT_SHIFT) & UART_RXFIFO_CNT_MASK) != 0;
}

static uint8_t hw_uart_getc(void) {
    /* The FIFO is a single address; reading it pops one byte. Only the low
     * 8 bits carry data (TRM Register 45.1). */
    return (uint8_t)(REG(UART_FIFO(g_uart_base)) & 0xffu);
}

/* Whether the TX FIFO has room, asked by counting rather than by trusting a
 * status flag.
 *
 * E1 left open whether a saturating writer could overrun this FIFO, having
 * seen a stream of 0x05 that decoded at no baud rate; the suspicion at the
 * time was that TXFIFO_CNT was being read wrongly. It was not being read at
 * all -- minimal_esp32p4.c gated on it, but that program's own bound was the
 * open question. The field is now confirmed against TRM Register 45.21
 * (bits [23:16]) and the depth against SOC_UART_FIFO_LEN (128), so this is a
 * real count against a real capacity and cannot silently overrun. */
static bool hw_uart_tx_room(void) {
    uint32_t st = REG(UART_STATUS(g_uart_base));
    uint32_t used = (st >> UART_TXFIFO_CNT_SHIFT) & UART_TXFIFO_CNT_MASK;
    return used < UART_FIFO_DEPTH;
}

/* --- the ISR, E3 --------------------------------------------------------
 *
 * One waiter slot per direction, held by whichever task is about to block,
 * and the corresponding INT_ENA bit is set only for the duration of that
 * wait. Structurally the same as drivers/uart_16550.c's, and for the same
 * reason: the conditions are level, so a source left enabled with nobody
 * waiting on it fires on every return from interrupt for as long as the
 * condition holds. A second concurrent waiter in the same direction falls
 * back to polling rather than being queued -- the single-slot, busy-refuses
 * shape chan_call() itself uses.
 *
 * A note on what this is *not*: the ISR does not touch the FIFO. It wakes
 * the task that was waiting and lets that task do the read or the write.
 * Draining the FIFO here would put console bytes somewhere the demux
 * (drivers/uart_net.c) cannot see them. */
static volatile int g_rx_waiter = -1;
static volatile int g_tx_waiter = -1;
static volatile uint32_t g_uart_irq_count;    /* see uart_irq_count()    */
static volatile uint32_t g_uart_irq_rx_wakes; /* see uart_irq_rx_wakes() */
static volatile uint32_t g_uart_irq_tx_arms;  /* see uart_irq_tx_arms()  */
static volatile uint32_t g_uart_irq_tx_wakes; /* see uart_irq_tx_wakes() */
static volatile uint32_t g_uart_irq_tx_seen;  /* see uart_irq_tx_seen()  */

static void uart_isr(void *ctx) {
    (void)ctx;
    g_uart_irq_count++;
    uintptr_t base = g_uart_base;
    uint32_t st = REG(UART_INT_ST(base));

    /* Everything that fired gets disabled, whether or not there was a waiter
     * for it. That is deliberate belt-and-braces: only a task about to block
     * ever re-enables a bit, so masking unconditionally here means no
     * sequence of events -- a race with the fast path, a spurious source
     * sharing this line, an ISR that ran twice -- can leave a level
     * condition enabled with nothing to serve it. The cost of being wrong in
     * this direction is one interrupt not taken; the cost of being wrong in
     * the other is a board that only prints. */
    uint32_t served = st & (UART_RX_INTS | UART_TXFIFO_EMPTY_INT);
    if (served) REG(UART_INT_ENA(base)) &= ~served;

    if ((st & UART_RX_INTS) && g_rx_waiter >= 0) {
        g_uart_irq_rx_wakes++;
        int pid = g_rx_waiter;
        g_rx_waiter = -1;
        task_unblock(pid);
    }
    if (st & UART_TXFIFO_EMPTY_INT) g_uart_irq_tx_seen++;
    if ((st & UART_TXFIFO_EMPTY_INT) && g_tx_waiter >= 0) {
        g_uart_irq_tx_wakes++;
        int pid = g_tx_waiter;
        g_tx_waiter = -1;
        task_unblock(pid);
    }

