domschl/LugalOS/drivers/uart_esp32p4.c
    /* Acknowledge last. This is also what takes the CLIC's pending bit down:
     * the line is configured level-triggered (arch/riscv/common/trap.c), so
     * clicintip follows the peripheral and "cleared from source" means
     * exactly this store. */
    REG(UART_INT_CLR(base)) = st;
}

/* The blocking primitives. Whoever calls these owns the hardware -- normally
 * the uart task, exclusively, once it is up.
 *
 * Two paths, in this order: block on the interrupt if there is a task to
 * block and the slot is free, otherwise spin with sched_yield(). The spin is
 * not a leftover -- it is the only thing that works before sched_init(), and
 * every line of boot output before the uart task exists goes through it. */
static void uart_hw_putc_blocking_ex(char c, bool may_block) {
    if (!g_uart_base) return;
    if (hw_uart_tx_room()) {
        REG(UART_FIFO(g_uart_base)) = (uint8_t)c;
        return;
    }
    /* Nothing between the fast-path miss and task_block() may restore
     * interrupts early: a TX interrupt landing in that gap would find this
     * task still RUNNING rather than BLOCKED, task_unblock() would no-op,
     * and the ISR would have "served" a wakeup nobody was asleep for -- a
     * silent, permanent lost wakeup. So the whole decision runs under one
     * irq_save(). Copied in shape from drivers/uart_16550.c, where the same
     * comment is the record of having got it wrong first. */
    /* The caller decides whether blocking is even allowed here.
     *
     * uart_flush() reaches this function by two very different routes. Through
     * the uart *task*, blocking is right: the task exists to sleep until the
     * FIFO drains. Through the **fallback** -- taken when the endpoint is busy
     * or the task is not running -- blocking is wrong, and not subtly so. That
     * path exists precisely because the task machinery is unavailable, and
     * task_block()ing there re-introduces the dependency the fallback was
     * written to escape: the caller sleeps waiting for a TX interrupt while
     * holding whatever it was in the middle of, and on this board that is a
     * printk() that never returns.
     *
     * Kept on its own merits, and the record of how it was arrived at is worth
     * preserving because the reasoning was right and the diagnosis was wrong.
     * E7 saw a boot that stopped mid-console-line once E6's /flash0 added
     * output after the shell starts reading the console, and this looked like
     * the cause: the shell's pending blocking read occupies the single-slot
     * uart endpoint, every later printk falls back to direct hardware, and the
     * first one to find a full FIFO would block for good. The TX interrupt was
     * blamed for never arriving.
     *
     * It arrives. uart_irq_tx_arms() and uart_irq_tx_wakes() are equal on this
     * board, and enabling the source with a drained FIFO delivers an interrupt
     * immediately -- both measured. The hang was the L2-cache memory
     * corruption (esp32p4_l2_cache_shrink(), arch/riscv/common/trap.c) eating
     * task context frames, and it presented as a lost wakeup because the task
     * that should have been woken no longer had a frame to return to.
     *
     * The split stays regardless: a fallback whose whole reason for existing is
     * that the task machinery is unavailable must not call task_block(). That
     * argument never depended on the bug. */
    uintptr_t flags = irq_save();
    /* Acknowledge before re-testing, not after. Both orderings look right;
     * only this one is. INT_CLR takes down a raw bit that may be left over
     * from an earlier condition -- without it the enable below would deliver
     * an immediate stale interrupt and this function would return having
     * written to a full FIFO. But clearing it *after* the test would instead
     * discard the notification for a condition that became true in between,
     * and the task would sleep on an event that had already happened. Clear
     * first, test second: hardware re-asserts the raw bit for as long as the
     * condition holds, so anything that arrives from here on is either seen
     * by the test or delivered by the enable. */
    REG(UART_INT_CLR(g_uart_base)) = UART_TXFIFO_EMPTY_INT;
    if (!hw_uart_tx_room()) {
        if (may_block && g_tx_waiter < 0 && sched_has_task()) {
            g_tx_waiter = sched_current_pid();
            g_uart_irq_tx_arms++;
            REG(UART_INT_ENA(g_uart_base)) |= UART_TXFIFO_EMPTY_INT;
            task_block();
        } else {
            irq_restore(flags);
            while (!hw_uart_tx_room()) sched_yield();
            flags = irq_save();
        }
    }
    irq_restore(flags);
    REG(UART_FIFO(g_uart_base)) = (uint8_t)c;
}

/* The two entry points, so the choice is made by name at each call site
 * rather than by a flag someone has to remember to pass. */
static void uart_hw_putc_blocking(char c) { uart_hw_putc_blocking_ex(c, true); }
static void uart_hw_putc_polling(char c)  { uart_hw_putc_blocking_ex(c, false); }

static uint8_t uart_hw_getc_blocking(void) {
    if (hw_uart_has_char()) return hw_uart_getc();
    uintptr_t flags = irq_save();
    /* Clear first, test second -- see uart_hw_putc_blocking() above for why
     * the other order loses a keystroke rather than merely being untidy. */
    REG(UART_INT_CLR(g_uart_base)) = UART_RX_INTS;
    if (!hw_uart_has_char()) {
        if (g_rx_waiter < 0 && sched_has_task()) {
            g_rx_waiter = sched_current_pid();
            REG(UART_INT_ENA(g_uart_base)) |= UART_RX_INTS;
            task_block();
        } else {
            irq_restore(flags);
            while (!hw_uart_has_char()) sched_yield();
            flags = irq_save();
        }
    }
    irq_restore(flags);
    return hw_uart_getc();
}

/* --- the uart driver task (M4, plan/phase12_microkernel_migration.md) ----
 *
 * The same wire protocol drivers/uart_16550.c serves, byte for byte:
 *
 *   'H'      -> has-char query.  resp: 1 byte, 0 or 1.
 *   'R'      -> read, blocking.  resp: 1 byte, the char read.
 *   'W', ... -> write the req_len-1 bytes that follow. resp: empty.
 *
 * This is the third copy of this machinery in the tree (16550, RP2350, and
 * now here) and that is worth naming rather than leaving to be noticed. Two
 * copies were defensible: the RP2350 one carries a USB CDC mirror and a
 * demux bypass the QEMU one does not. A third makes the shared part large
 * enough to be worth factoring, but E2 is the wrong moment -- extracting it
 * now would change two drivers that work, on two boards, to make room for a
 * third that has never run. E3 adds this file's interrupt path, at which
 * point all three have the same shape and the comparison is real; the debt
 * is recorded there rather than paid here on speculation. */
#define UART_REQ_HASCHAR ((uint8_t)'H')
#define UART_REQ_READ    ((uint8_t)'R')
#define UART_REQ_WRITE   ((uint8_t)'W')

#define UART_TX_BATCH_CAP 256
#define UART_REQ_CAP (UART_TX_BATCH_CAP + 1)

