domschl/LugalOS/drivers/uart_esp32p4.c
static uint8_t          g_uart_req[UART_REQ_CAP];
static uint8_t          g_uart_resp[1];
static chan_endpoint_t *g_uart_ep;
static int              g_uart_task_pid = -1;
static uint32_t         g_uart_write_calls;
static volatile bool    g_uart_write_in_flight;

uint32_t uart_write_call_count(void) { return g_uart_write_calls; }
uint32_t uart_irq_count(void) { return g_uart_irq_count; }
uint32_t uart_irq_rx_wakes(void) { return g_uart_irq_rx_wakes; }
uint32_t uart_irq_tx_arms(void) { return g_uart_irq_tx_arms; }
uint32_t uart_irq_tx_wakes(void) { return g_uart_irq_tx_wakes; }
uint32_t uart_irq_tx_seen(void) { return g_uart_irq_tx_seen; }


static bool uart_task_alive(void) {
    if (g_uart_task_pid < 0) return false;
    int st = sched_task_state(g_uart_task_pid);
    return st != TASK_UNUSED && st != TASK_DEAD;
}

/* Must never printk() from inside this loop -- a caller can be blocked on
 * this very endpoint while holding printk_lock(), and taking that lock here
 * would deadlock against it. uart_debug_putc() exists for that case. */
static void uart_task_body(void *arg) {
    (void)arg;
    while (!g_uart_ep) sched_yield();

    for (;;) {
        uint32_t req_len = chan_serve_wait(g_uart_ep);
        if (req_len == 0) { chan_serve_reply(g_uart_ep, 0); continue; }
        switch (g_uart_req[0]) {
            case UART_REQ_HASCHAR:
                g_uart_resp[0] = hw_uart_has_char() ? 1 : 0;
                chan_serve_reply(g_uart_ep, 1);
                break;
            case UART_REQ_READ:
                g_uart_resp[0] = uart_hw_getc_blocking();
                chan_serve_reply(g_uart_ep, 1);
                break;
            case UART_REQ_WRITE:
                g_uart_write_calls++;
                g_uart_write_in_flight = true;
                for (uint32_t i = 1; i < req_len; i++) {
                    uart_hw_putc_blocking((char)g_uart_req[i]);
                }
                g_uart_write_in_flight = false;
                chan_serve_reply(g_uart_ep, 0);
                break;
            default:
                chan_serve_reply(g_uart_ep, 0);
                break;
        }
    }
}

int uart_task_start(void) {
    /* Unmask the console's interrupt line here rather than in uart_init(),
     * for the ordering reason that function's step 8 sets out: trap_init()
     * masks every CLIC line as its first act, and it runs in between. From
     * this point a task blocking on the console really sleeps. */
    arch_irq_enable(ESP32P4_CLIC_IRQ_UART0);

    int pid = task_create_driver("uart", uart_task_body, NULL, 1);
    if (pid < 0) {
        printk("[UART] Could not start the uart task; console stays on direct hardware access.\n");
        return -1;
    }
    task_set_priority(pid, TASK_PRIO_INTERRUPT);
    if (chan_register_task("uart", pid, g_uart_req, sizeof(g_uart_req),
                           g_uart_resp, sizeof(g_uart_resp)) != 0) {
        printk("[UART] Could not register the uart channel endpoint; falling back to direct hardware access.\n");
        return -1;
    }
    g_uart_ep = chan_lookup("uart");
    g_uart_task_pid = pid;
    printk("[UART] Driver running as task #%d, reachable via chan_call(\"uart\", ...)\n", pid);
    return pid;
}

/* --- bring-up ----------------------------------------------------------- */

void uart_init(uintptr_t base_addr) {
    if (base_addr != 0) g_uart_base = base_addr;
    uintptr_t base = g_uart_base;

    /* 1. Bus and core clocks on.
     *
     * All three of these reset to enabled, and the ROM has certainly turned
     * them on already -- this is not fixing anything today. It is the part
     * that stops being redundant the first time this image is entered by
     * something other than the ROM's download loader. */
    REG(SOC_CLK_CTRL1) |= UART0_SYS_CLK_EN;
    REG(SOC_CLK_CTRL2) |= UART0_APB_CLK_EN;

    /* 2. Source clock: XTAL, undivided.
     *
     * SCLK_DIV_NUM is the pre-divider in front of the UART's own 12.4-bit
     * divisor, and it is written as (divisor - 1). Zero means divide by one,
     * which is what a 40 MHz source and a 115200 target want -- the whole
     * ratio fits in CLKDIV's 12 integer bits with room to spare
     * (40e6/115200 = 347, against a 4095 ceiling), so the pre-divider has
     * nothing to do. Written explicitly rather than assumed zero. */
    uint32_t c110 = REG(PERI_CLK_CTRL110);
    c110 &= ~UART0_CLK_SRC_SEL_MASK;
    REG(PERI_CLK_CTRL110) = c110 | UART0_CLK_SRC_XTAL | UART0_CLK_EN;
    REG(PERI_CLK_CTRL111) &= ~UART0_SCLK_DIV_NUM_MASK;

    REG(UART_CLK_CONF(base)) |= UART_TX_SCLK_EN | UART_RX_SCLK_EN;

    /* 3. Baud rate.
     *
     * The divisor is CLKDIV + FRAG/16, so compute it in sixteenths and split
     * it. 40 MHz / 115200 = 347.222..., i.e. 5555.55 sixteenths -> 5555 ->
     * CLKDIV 347, FRAG 3. That divisor gives 115209.5 baud, 0.008% fast.
     *
     * Integer arithmetic throughout: this file has no float, the ABI is
     * soft-float, and a rounding constant would be one more number to
     * justify. Truncation costs at most 1/16 of a divisor step, which at
     * these rates is under 0.05%.
     *
     * If CONFIG_UART0_BAUD were ever set so low that CLKDIV overflowed its
     * 12 bits, the mask below would silently produce a wildly wrong rate --
     * so the case is a compile-time error instead. At 40 MHz the floor is
     * 9773 baud, which is under every rate this project uses. */
#if (CONFIG_UART0_SCLK_HZ / CONFIG_UART0_BAUD) > 4095
#error "CONFIG_UART0_BAUD is too low for a 12-bit UART_CLKDIV at CONFIG_UART0_SCLK_HZ -- the pre-divider in PERI_CLK_CTRL111 would have to be used"
#endif
    uint32_t sixteenths = ((uint32_t)CONFIG_UART0_SCLK_HZ * 16u) / (uint32_t)CONFIG_UART0_BAUD;
    uint32_t clkdiv = (sixteenths >> 4) & UART_CLKDIV_MASK;
    uint32_t frag   = sixteenths & 0xfu;
    REG(UART_CLKDIV_SYNC(base)) = clkdiv | (frag << UART_CLKDIV_FRAG_SHIFT);

    /* 4. Frame format: 8N1, no flow control, no loopback.
     *
     * Read-modify-write rather than a whole-register store: CONF0 also holds
     * MEM_CLK_EN and ERR_WR_MASK, whose reset values are correct and which
     * this file has no opinion about. Zeroing the register would clear them
     * along with everything else. */
    uint32_t conf0 = REG(UART_CONF0_SYNC(base));
    conf0 &= ~(UART_BIT_NUM_MASK | UART_STOP_BIT_NUM_MASK | UART_PARITY_EN |
               UART_TX_FLOW_EN | UART_LOOPBACK);
    conf0 |= UART_BIT_NUM_8 | UART_STOP_BIT_NUM_1;
    REG(UART_CONF0_SYNC(base)) = conf0;

    uart_commit(base);

