domschl/LugalOS/drivers/uart_esp32p4.c
    /* 5. Empty both FIFOs.
     *
     * After the format and rate are committed, not before: anything already
     * queued was framed by the ROM's settings, and on the RX side it is
     * whatever the host said while esptool still owned the port -- E1
     * recorded that merely *opening* the host port puts a stray byte in the
     * RX FIFO, and that stray byte is what made an earlier heartbeat gate
     * useless. Starting from empty is how the shell's first prompt is not
     * answered by a character nobody typed.
     *
     * Both reset bits are level, not pulses: written, then written back to
     * zero. Leaving RXFIFO_RST asserted holds the FIFO empty forever, which
     * presents as a keyboard that does nothing. */
    conf0 = REG(UART_CONF0_SYNC(base));
    REG(UART_CONF0_SYNC(base)) = conf0 | UART_RXFIFO_RST | UART_TXFIFO_RST;
    uart_commit(base);
    REG(UART_CONF0_SYNC(base)) = conf0 & ~(UART_RXFIFO_RST | UART_TXFIFO_RST);
    uart_commit(base);

    /* 6. The pads, last.
     *
     * Last on purpose: until MCU_SEL is written the pad still carries
     * whatever the ROM left driving it, and doing this first would put a
     * half-configured UART on the wire for the duration of the steps above.
     *
     * TX needs only the function select. RX needs FUN_IE, or the input
     * buffer stays off and the pin reads as permanently idle -- and a weak
     * pull-up, so an unplugged console line idles high (a UART's idle level)
     * rather than floating and framing noise into the RX FIFO. */
    uint32_t pad = REG(IOMUX_PAD(CONFIG_UART0_TX_GPIO));
    pad &= ~IOMUX_MCU_SEL_MASK;
    REG(IOMUX_PAD(CONFIG_UART0_TX_GPIO)) = pad | IOMUX_FUN_UART0;

    pad = REG(IOMUX_PAD(CONFIG_UART0_RX_GPIO));
    pad &= ~IOMUX_MCU_SEL_MASK;
    REG(IOMUX_PAD(CONFIG_UART0_RX_GPIO)) = pad | IOMUX_FUN_UART0 |
                                           IOMUX_FUN_IE | IOMUX_FUN_PU;

    /* 7. Interrupts (E3).
     *
     * Everything masked and acknowledged first. INT_ENA has no reset value
     * this code can rely on -- the ROM's own download loader uses this UART
     * -- and TXFIFO_EMPTY_INT_RAW is *set at reset* (TRM Register 45.2's
     * reset row has bit 1 high, because an empty TX FIFO is what the
     * condition means), so an enable without a preceding clear would take an
     * interrupt for a condition that was true before the kernel existed. */
    REG(UART_INT_ENA(base)) = 0;
    REG(UART_INT_CLR(base)) = 0xffffffffu;

    /* Thresholds. RX: 1, the lowest useful value -- one byte in the FIFO
     * should wake a reader, and the timeout below covers the reading of that
     * threshold as exclusive. TX: 64, half the 128-byte FIFO, so a writer
     * that filled the FIFO is woken with room for a useful batch rather than
     * for a single byte. */
    uint32_t conf1 = REG(UART_CONF1(base));
    conf1 &= ~(UART_RXFIFO_FULL_THRHD_MASK | UART_TXFIFO_EMPTY_THRHD_MASK);
    conf1 |= (1u << UART_RXFIFO_FULL_THRHD_SHIFT) |
             (64u << UART_TXFIFO_EMPTY_THRHD_SHIFT);
    REG(UART_CONF1(base)) = conf1;

    /* RX idle timeout: 2 byte-times. Short enough that a keystroke is not
     * perceptibly delayed (at 115200 a byte-time is 87 us), long enough not
     * to fire in the middle of a paste. */
    uint32_t tout = REG(UART_TOUT_CONF_SYNC(base));
    tout &= ~UART_RX_TOUT_THRHD_MASK;
    tout |= (2u << UART_RX_TOUT_THRHD_SHIFT) | UART_RX_TOUT_EN;
    REG(UART_TOUT_CONF_SYNC(base)) = tout;
    uart_commit(base);

    /* The A3b demux (drivers/uart_net.c) gets the raw accessors, same as on
     * every other target: when `p9share` is on, some of what is waiting in
     * the FIFO is 9P frame bytes and the console may not read the register
     * directly. */
    uart_demux_init(hw_uart_has_char, hw_uart_getc);

    /* 8. Route the peripheral to a CPU interrupt line, and attach the
     * handler to it.
     *
     * UART0's interrupt signal is source 31 in the interrupt matrix (TRM
     * Table 13.4-1 -- and its mapping register's offset 0x7C is 4*31, which
     * is the same fact stated twice). Nothing reaches the CPU until it has
     * been routed to one of the 32 lines this core has. *Which* line is an
     * allocation rather than a hardware fact, so it is written down in
     * arch/esp32p4_intr.h, where a second driver picking the same number
     * would be a visible edit instead of a coincidence.
     *
     * Handler before enable, as arch/trap.h asks. The enable itself is not
     * here: main.c calls uart_init() long before trap_init(), and
     * trap_init()'s CLIC bring-up begins by masking every line -- including
     * one enabled from here, which would then never be re-enabled. So
     * arch_irq_enable() lives in uart_task_start() instead, which runs after
     * both. Nothing is lost by waiting: until sched_init() there is no task
     * for the ISR to wake, and every blocking primitive above already falls
     * back to polling in exactly that case. */
    if (esp32p4_intmtx_route(31u, ESP32P4_CLIC_IRQ_UART0) == 0) {
        devirq_attach(ESP32P4_CLIC_IRQ_UART0, uart_isr, NULL);
    }
}

/* --- the facade (identical in shape to drivers/uart_16550.c's) ----------- */

static char       g_tx_batch[MAX_HARTS][UART_TX_BATCH_CAP];
static uint32_t   g_tx_batch_len[MAX_HARTS];
static spinlock_t g_tx_batch_lock;

static int uart_call_with_retry(const uint8_t *req, uint32_t req_len,
                                uint8_t *resp, uint32_t resp_max) {
    for (int attempt = 0; attempt < 8; attempt++) {
        int n = chan_call(g_uart_ep, req, req_len, resp, resp_max);
        if (n >= 0) return n;
        sched_yield();
    }
    return -1;
}

void uart_flush(void) {
    char local[UART_TX_BATCH_CAP];
    uintptr_t flags = spin_lock_irqsave(&g_tx_batch_lock);
    unsigned h = hart_id();
    uint32_t len = g_tx_batch_len[h];
    if (len > 0) {
        memcpy(local, g_tx_batch[h], len);
        g_tx_batch_len[h] = 0;
    }
    spin_unlock_irqrestore(&g_tx_batch_lock, flags);
    if (len == 0) return;

    if (uart_demux_is_enabled() || !uart_task_alive()) {
        for (uint32_t i = 0; i < len; i++) uart_hw_putc_polling(local[i]);
        return;
    }
    uint8_t req[1 + UART_TX_BATCH_CAP];
    req[0] = UART_REQ_WRITE;
    memcpy(&req[1], local, len);
    uint8_t resp[1];
    /* Never fall back to direct hardware access while another WRITE is
     * actually in flight -- that is what produced byte-level interleaved
     * console garbage on RP2350, and this board's UART is real hardware with
     * real transmit time, so the same race exists here. A pending READ can
     * run for as long as a human takes to press a key and must not be waited
     * out; g_uart_write_in_flight is what tells the two apart. */
    for (;;) {
        int n = chan_call(g_uart_ep, req, 1 + len, resp, sizeof(resp));
        if (n >= 0) return;
        if (!g_uart_write_in_flight) break;
        sched_yield();
    }
    for (uint32_t i = 0; i < len; i++) uart_hw_putc_polling(local[i]);
}

void uart_putc(char c) {
    uintptr_t flags = spin_lock_irqsave(&g_tx_batch_lock);
    while (g_tx_batch_len[hart_id()] >= UART_TX_BATCH_CAP) {
        spin_unlock_irqrestore(&g_tx_batch_lock, flags);
        uart_flush();
        flags = spin_lock_irqsave(&g_tx_batch_lock);
    }
    g_tx_batch[hart_id()][g_tx_batch_len[hart_id()]++] = c;
    spin_unlock_irqrestore(&g_tx_batch_lock, flags);
}

/* A plain UART FIFO cannot be inspected without consuming, so there is
 * nothing to peek and kernel/console.c's pump keeps the behaviour it has on
 * QEMU. Same answer, same reason, as drivers/uart_16550.c. */
bool uart_peek_interrupt(void) {
    return false;
}

bool uart_has_char(void) {
    uart_flush();
    if (uart_demux_is_enabled()) return uart_demux_console_has_char();
    if (uart_task_alive()) {
        uint8_t req[1] = { UART_REQ_HASCHAR };
        uint8_t resp[1];
        if (uart_call_with_retry(req, 1, resp, 1) == 1) return resp[0] != 0;
    }
    return hw_uart_has_char();
}

char uart_getc(void) {
    uart_flush();
    if (uart_demux_is_enabled()) {
        while (!uart_demux_console_has_char()) sched_yield();
        return uart_demux_console_getc();
    }
    if (uart_task_alive()) {
        uint8_t req[1] = { UART_REQ_READ };
        uint8_t resp[1];
        if (uart_call_with_retry(req, 1, resp, 1) == 1) return (char)resp[0];
    }
    return (char)uart_hw_getc_blocking();
}

void uart_puts(const char *s) {
    if (!s) return;
    while (*s) {
        if (*s == '\n') uart_putc('\r');
        uart_putc(*s++);
    }
}

/* Low-level driver diagnostics only: never routed through the task or the
 * batch above, so tracing that might be used to debug either mechanism does
 * not depend on them. */
/* See drivers/uart.h. Bounded spin on TX FIFO room, then drop. No yield, no
 * block -- in particular this never touches g_tx_waiter or INT_ENA, so it is
 * safe to call from inside the ISR that owns them. */
void uart_critical_putc(char c) {
    if (!g_uart_base) return;
    for (unsigned i = 0; i < 200000u; i++) {
        if (hw_uart_tx_room()) {
            REG(UART_FIFO(g_uart_base)) = (uint8_t)c;
            return;
        }
    }
}

void uart_critical_puts(const char *s) {
    if (!s) return;
    while (*s) {
        if (*s == '\n') uart_critical_putc('\r');
        uart_critical_putc(*s++);
    }
}

/* See drivers/uart.h. Same batch as uart_flush(), written the bounded way. */
void uart_flush_critical(void) {
    char local[UART_TX_BATCH_CAP];
    uintptr_t flags = spin_lock_irqsave(&g_tx_batch_lock);
    unsigned h = hart_id();
    uint32_t len = g_tx_batch_len[h];
    if (len > 0) {
        memcpy(local, g_tx_batch[h], len);
        g_tx_batch_len[h] = 0;
    }
    spin_unlock_irqrestore(&g_tx_batch_lock, flags);
    for (uint32_t i = 0; i < len; i++) uart_critical_putc(local[i]);
}

void uart_debug_putc(char c) {
    uart_hw_putc_blocking(c);
}

void uart_debug_puts(const char *s) {
    if (!s) return;
    while (*s) {
        if (*s == '\n') uart_debug_putc('\r');
        uart_debug_putc(*s++);
    }
}
